Revit 2027 API
StructuralSection.PlasticModulusStrongAxis Property
 Plastic section modulus in bending about main strong axis (Z, Wpl).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PlasticModulusStrongAxis { get; set; }
Public Property PlasticModulusStrongAxis As Double
	Get
	Set
public:
property double PlasticModulusStrongAxis {
	double get ();
	void set (double value);
}
member PlasticModulusStrongAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace